using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace selenium_wrapper
{
    class doc
    {
        // атрибутом name указывается название типа элемента страницы
        // а у элемента так же можно передавать название экземпляра

        // у контейнеров передается только название типа
    }



    // реализовать
    // генератор на основе модели организации
        // процессы, действия, пользователи

    // проверка полей на видимость и доступность анализируя страницу
    
    // геренрация и проверка состава страниц по заготовленному документу
    
    // усказать соответсвие генерируемой заявки и формы

    // С Аней выбрать кейсы для тестирования

}
